In [1]:
import pandas as pd

Introduction to Pandas DataFrame and it's creation

In [2]:
data = {"Name":["Anurag","Arinjai","Arjav","Abufroo"],
        "Age":[17,19,18,20],
        "State":["Rajasthan","MP","UK","Manipur"]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

      Name  Age      State
0   Anurag   17  Rajasthan
1  Arinjai   19         MP
2    Arjav   18         UK
3  Abufroo   20    Manipur

Accessing any row or column of a DataFrame

In [5]:
df["Name"]

0     Anurag
1    Arinjai
2      Arjav
3    Abufroo
Name: Name, dtype: object

In [11]:
df.iloc[2]

Name     Arjav
Age         18
State       UK
Name: 2, dtype: object

Accessing multiple rows and columns of a DataFrame

In [13]:
df[["Name","State"]]

      Name      State
0   Anurag  Rajasthan
1  Arinjai         MP
2    Arjav         UK
3  Abufroo    Manipur

In [16]:
df.iloc[[1,3]]

      Name  Age    State
1  Arinjai   19       MP
3  Abufroo   20  Manipur